set_operating_conditions -design_power_budget 63
set_property IOSTANDARD LVDS [get_ports SYSCLK3_N]
set_property PACKAGE_PIN BB18 [get_ports SYSCLK3_P]
set_property PACKAGE_PIN BC18 [get_ports SYSCLK3_N]
set_property IOSTANDARD LVDS [get_ports SYSCLK3_P]
set_property DQS_BIAS TRUE [get_ports SYSCLK3_P]
create_clock -period 10.000 -name sysclk3 [get_ports SYSCLK3_P]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins
{app_cmac_frontend_i/DUT/inst/cmac_usplus_0_gt_i/inst/gen_gtwizard_gtye4_top.cmac_usplus_0_gt_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[7].gen_enabled_channel.gtye4_channel_wrapp
er_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]] -to [get_clocks gt_ref_clk_p]
set_false_path -from [get_clocks gt_ref_clk_p] -to [get_clocks -of_objects [get_pins
{app_cmac_frontend_i/DUT/inst/cmac_usplus_0_gt_i/inst/gen_gtwizard_gtye4_top.cmac_usplus_0_gt_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[7].gen_enabled_channel.gtye4_channel_wrapp
er_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks sysclk3]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT1]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT2]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT3]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT4]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT2]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT3]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT4]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT1]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT2]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT3]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT4]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT2]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT3]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT4]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT0]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT2]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT3]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT4]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins clk_wiz_0_i/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks sysclk3]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT5]] -to [get_clocks sysclk3]
set_false_path -from [get_clocks -of_objects [get_pins HBM_CONTROLLER/u_mmcm_0/CLKOUT6]] -to [get_clocks sysclk3]
set_false_path -from [get_clocks -of_objects [get_pins
{app_cmac_frontend_i/DUT/inst/cmac_usplus_0_gt_i/inst/gen_gtwizard_gtye4_top.cmac_usplus_0_gt_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[7].gen_enabled_channel.gtye4_channel_wrapp
er_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]] -to [get_clocks sysclk3]
set_false_path -from [get_clocks sysclk3] -to [get_clocks -of_objects [get_pins
{app_cmac_frontend_i/DUT/inst/cmac_usplus_0_gt_i/inst/gen_gtwizard_gtye4_top.cmac_usplus_0_gt_gtwizard_gtye4_inst/gen_gtwizard_gtye4.gen_channel_container[7].gen_enabled_channel.gtye4_channel_wrapp
er_inst/channel_inst/gtye4_channel_gen.gen_gtye4_channel_inst[0].GTYE4_CHANNEL_PRIM_INST/TXOUTCLK}]]
create_debug_core u_ila_0 ila
